/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec 扩展";
"06 06 02 82 06 01 0A 01"		= "Telesec 机制";

"06 07 02 82 06 01 0A 01 00"	= "Telesec 鉴定";
"06 08 02 82 06 01 0A 01 00 01"	= "密码鉴定";
"06 08 02 82 06 01 0A 01 00 02" = "被保护的密码鉴定";
"06 08 02 82 06 01 0A 01 00 03" = "单向 X.509 鉴定";
"06 08 02 82 06 01 0A 01 00 04" = "双向 X.509 鉴定";
"06 08 02 82 06 01 0A 01 00 05" = "三向 X.509 鉴定";
"06 08 02 82 06 01 0A 01 00 06" = "单向 ISO9798 鉴定";
"06 08 02 82 06 01 0A 01 00 07" = "双向 ISO9798 鉴定";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom 鉴定";

"06 07 02 82 06 01 0A 01 01"	= "Telesec 签名";
"06 08 02 82 06 01 0A 01 01 01"	= "带 RSA 和 ISO9697 的 MD4";
"06 08 02 82 06 01 0A 01 01 02"	= "带 RSA 和 Telesec 签名标准的 MD4";
"06 08 02 82 06 01 0A 01 01 03"	= "带 RSA 和 ISO9697 的 MD5";
"06 08 02 82 06 01 0A 01 01 04"	= "带 RSA 和 Telesec 签名标准的 MD5";
"06 08 02 82 06 01 0A 01 01 05"	= "带 RSA 和 Telekom 签名标准的 RIPEMD-160";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA 签名";

"06 07 02 82 06 01 0A 01 02"	= "Telesec 加密";
"06 08 02 82 06 01 0A 01 02 00"	= "无";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "洋红色";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "单向功能";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "使用块密码的哈希算法";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC 功能";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec 模块";
"06 07 02 82 06 01 0A 02 00"	= "算法";
"06 07 02 82 06 01 0A 02 01"	= "属性类型";
"06 07 02 82 06 01 0A 02 02"	= "证书类型";
"06 07 02 82 06 01 0A 02 03"	= "邮件类型";
"06 07 02 82 06 01 0A 02 04"	= "PL 协议";
"06 07 02 82 06 01 0A 02 05"	= "SME 及其组件";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "有用的定义";
"06 07 02 82 06 01 0A 02 08"	= "STE 文件";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "电子订单";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP 非对称应用程序";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP 基础应用程序";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP 邮件";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP 时间戳应用程序";

"06 06 02 82 06 01 0A 03"		= "对象类";
"06 07 02 82 06 01 0A 03 00"	= "Telesec 其他名称";
"06 07 02 82 06 01 0A 03 01"	= "目录";
"06 07 02 82 06 01 0A 03 02"	= "目录类型";
"06 07 02 82 06 01 0A 03 03"	= "目录组";
"06 07 02 82 06 01 0A 03 04"	= "目录用户";
"06 07 02 82 06 01 0A 03 05"	= "对称密钥条目";

"06 06 02 82 06 01 0A 04"		= "软件包";
"06 06 02 82 06 01 0A 05"		= "参数";
"06 06 02 82 06 01 0A 06"		= "名称绑定";
"06 06 02 82 06 01 0A 07"		= "属性";
"06 07 02 82 06 01 0A 07 00"	= "应用程序组标识符";
"06 07 02 82 06 01 0A 07 01"	= "证书类型";
"06 07 02 82 06 01 0A 07 02"	= "Telesec 证书";
"06 07 02 82 06 01 0A 07 03"	= "证书号码";
"06 07 02 82 06 01 0A 07 04"	= "证书撤消清单";
"06 07 02 82 06 01 0A 07 05"	= "创建日期";
"06 07 02 82 06 01 0A 07 06"	= "签发者";
"06 07 02 82 06 01 0A 07 07"	= "命名授权";
"06 07 02 82 06 01 0A 07 08"	= "公共密钥目录";
"06 07 02 82 06 01 0A 07 09"	= "安全域";
"06 07 02 82 06 01 0A 07 0A"	= "主题";
"06 07 02 82 06 01 0A 07 0B"	= "撤消时间";
"06 07 02 82 06 01 0A 07 0C"	= "用户组参考";
"06 07 02 82 06 01 0A 07 0D"	= "有效性";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "安全邮件环境";
"06 07 02 82 06 01 0A 07 10"	= "匿名的公共密钥目录";
"06 07 02 82 06 01 0A 07 11"	= "Telesec 给定名称";
"06 07 02 82 06 01 0A 07 12"	= "名称附加";
"06 07 02 82 06 01 0A 07 13"	= "Telesec 邮政编码";
"06 07 02 82 06 01 0A 07 14"	= "名称识别符";
"06 07 02 82 06 01 0A 07 15"	= "Telesec 证书清单";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust 证书清单";
"06 07 02 82 06 01 0A 07 17"	= "X.509 证书清单";
"06 07 02 82 06 01 0A 07 18"	= "签发时间";
"06 07 02 82 06 01 0A 07 19"	= "实物卡号码";
"06 07 02 82 06 01 0A 07 1A"	= "File Type";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl 文件是归档文件";
"06 07 02 82 06 01 0A 07 1C"	= "电子邮件地址";
"06 07 02 82 06 01 0A 07 1D"	= "证书模板清单";
"06 07 02 82 06 01 0A 07 1E"	= "目录名称";
"06 07 02 82 06 01 0A 07 1F"	= "目录类型名称";
"06 07 02 82 06 01 0A 07 20"	= "目录组名称";
"06 07 02 82 06 01 0A 07 21"	= "目录用户名称";
"06 07 02 82 06 01 0A 07 22"	= "撤消标记";
"06 07 02 82 06 01 0A 07 23"	= "对称密钥条目名称";
"06 07 02 82 06 01 0A 07 24"	= "GL 号码";
"06 07 02 82 06 01 0A 07 25"	= "GO 号码";
"06 07 02 82 06 01 0A 07 26"	= "G 密钥数据";
"06 07 02 82 06 01 0A 07 27"	= "Z 密钥数据";
"06 07 02 82 06 01 0A 07 28"	= "KT 密钥数据";
"06 07 02 82 06 01 0A 07 2A"	= "KT 密钥号码";
"06 07 02 82 06 01 0A 07 33"	= "撤消生成的时间";
"06 07 02 82 06 01 0A 07 34"	= "责任文本";

"06 06 02 82 06 01 0A 08"		= "属性组";
"06 06 02 82 06 01 0A 09"		= "动作";
"06 06 02 82 06 01 0A 0A"		= "通知";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "安全应用程序";

"06 06 02 82 06 01 0A 0C"		= "证书和 CRL 扩展定义";

"06 07 02 82 06 01 0A 0C 00"	= "证书扩展责任限制扩展";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec 证书 ID 扩展";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec 策略标识符";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec 策略限定符 ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL 过滤扩展";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL 过滤扩展";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec 命名授权扩展";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "用户 ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 邮箱";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "域组件";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "澳大利亚商业登记号码";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "发给澳大利亚策略标识符证书";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "私人印章";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "公司印章";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "法律印章";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "引导印章";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "内部网印章";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "策略标识符印章";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "对称加密算法";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS 高保证策略标识符";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK 策略标识符";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT 个人标识符";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 模块";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 证书管理";
"06 06 2A 86 48 CE 38 02"		= "保持指令";
"06 07 2A 86 48 CE 38 02 01"	= "保持指令－无";
"06 07 2A 86 48 CE 38 02 02"	= "致电签发者";
"06 07 2A 86 48 CE 38 02 03"	= "拒绝";
"06 07 2A 86 48 CE 38 02 04"	= "拾起令牌";
"06 06 2A 86 48 CE 38 03"		= "属性";
"06 06 2A 86 48 CE 38 03 01"	= "会签";
"06 06 2A 86 48 CE 38 03 02"	= "属性证书";
"06 06 2A 86 48 CE 38 04"		= "算法";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA 匹配";
"06 07 2A 86 48 CE 38 04 03"	= "带 SHA-1 的 DSA";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 字段类型";
"06 07 2A 86 48 CE 3D 01 01"	= "质数域";
"06 07 2A 86 48 CE 3D 01 02"	= "首数-2 域";
"06 09 2A 86 48 CE 3D 01 02 03"	= "首数-2 基";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "空基础";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "三项式基础";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "五项式基础";
"06 06 2A 86 48 CE 3D 02"		= "公共密钥类型";
"06 07 2A 86 48 CE 3D 02 01"	= "椭圆曲线公共密钥";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 字段类型";
"06 07 2A 86 48 CE 3E 01 01"	= "伽罗华域质数";
"06 06 2A 86 48 CE 3E 02"		= "号码类型";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman 公共密钥";
"06 06 2A 86 48 CE 3E 03"		= "方案";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman 静态";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman 短暂";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman 混合 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman 混合 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust 版本信息";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "带 MD5 和 CAST5-CBC 的 PBE";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "基于密码保护的 MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust 用户";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA 信息";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "属性证书";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA 加密";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "带 RSA 加密的 MD2";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "带 RSA 加密的 MD4";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "带 RSA 加密的 MD5";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "带 RSA 加密的 SHA-1";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP 加密 (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP 加密";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "指定的 RSA-OAEP 标签";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS 签名方案";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "带 RSA 加密的 SHA-256";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "带 RSA 加密的 SHA-384";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "带 RSA 加密的 SHA-512";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "带 RSA 加密的 SHA-224";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA 加密";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman 密钥协议";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "带 MD2 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "带 MD5 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "带 MD2 和 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "带 MD5 和 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "带 MD5 和 XOR 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "带 SHA 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "数据";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "签名数据";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "包络数据";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "签名和包络数据";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "摘要数据";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "加密数据";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "带属性的数据";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "加密的专用密钥信息";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "电子邮件地址";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "未结构化的名称";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "内容类型";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "邮件摘要";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "签名时间";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "会签";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "挑战密码";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "未结构化的地址";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "扩展的证书属性";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "签发者和序列号";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "密码检查";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "公共密钥";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signing Description";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "扩展请求";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME 功能";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "首选签名数据";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "不能解密任何";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "回执请求";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "回执";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "内容提示";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "邮件清单扩展历史记录";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME 模块";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "加密邮件语法";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "增强的安全服务";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME 对象标识符";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 邮件";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS 电子签名 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS 电子签名 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS 电子签名策略 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS 电子签名策略 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME 内容类型";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME 鉴定属性";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME 算法";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME 证书分发";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP 证书分发";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME 签名策略限定符";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME 签名类型识别符";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "原创签名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "域签名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "附加属性签名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "检查签名";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME 功能";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "首选内部二进制";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "友好名称（用于 PKCS-12）";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "本地密钥 ID（用于 PKCS-12）";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "证书类型（用于 PKCS-12）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 证书（用于 PKCS-12）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI 证书（用于 PKCS-12）";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL 类型（用于 PKCS-12）";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL（用于 PKCS-12）";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 个人信息交换语法";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 基于密码的加密 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "带 SHA-1 和 128 位 RC4 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "带 SHA-1 和 40 位 RC4 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "带 SHA-1 和 3 密钥三重 DES-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "带 SHA-1 和 2 密钥三重 DES-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "带 SHA-1 和 128 位 RC2-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "带 SHA-1 和 40 位 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 密钥隐蔽";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 密钥包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 证书和 CRL 包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 秘密包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 安全内容 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 隐蔽密钥包 ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 证书包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 证书和 CRL 包 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI 证书包 ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 基于密码的加密 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "带 SHA-1 和 128 位 RC4 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "带 SHA-1 和 40 位 RC4 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "带 SHA-1 和三重 DES-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "带 SHA-1 和 128 位 RC2-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "带 SHA-1 和 40 位 RC2-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "带 SHA-1 和 RC4 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "带 SHA-1 和 RC2-CBC 的 PKCS-12 PBE";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 包络 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "带 128 位 RC4 的 PKCS-12 RSA 加密";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "带 40 位 RC4 的 PKCS-12 RSA 加密";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "带三重 DES 的 PKCS-12 RSA 加密";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 签名 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "带 SHA-1 摘要的 PKCS-12 RSA 签名";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Version 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 包 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 密钥包";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 隐蔽密钥包";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 证书包";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL 包";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 秘密包";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 安全内容包";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 模块";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 属性";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 内容类型";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 内容";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI 摘要算法";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "带 SHA-1 的 HMAC";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI 加密算法";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "带 MAC 的 RC4";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus 未知策略标识符";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT 用户至用户 Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server 对象类";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "站点编址";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "类方案";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "属性方案";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "邮箱代理";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "邮箱";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "容器";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "邮件收件人";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "交付机制";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft 文件格式";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "鉴定代码";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC 间接数据上下文";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC 代理信息";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC 声明类型";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC 作品信息";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC 证书扩展";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE 图像数据";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC 链接（类型 1）";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "个人代码签名";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "商业代码签名";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC 链接（类型 2）";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC 最低标准";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC 金融标准";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC 链接（类型 3）";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM 安全支持提供商";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "时间戳会签";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "证书信任清单";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "排序 CTL 扩展";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "下一个更新位置";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "增强的密钥使用";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "证书信任清单签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "时间戳签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "服务器选通秘密成员";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "使用序列号的加密";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "加密的文件系统";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "加密文件系统恢复";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows 兼容硬件";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows 硬件 OEM 签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "嵌入式 NT 签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "信任的根清单签名";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "合格的隶属";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "密钥恢复";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "文稿签名";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "属性对象标识符";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "是/否信任属性";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft 音乐 DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM 个性化";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft 许可";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft 许可服务器";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 对象标识符";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "续订证书";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "注册名称/数值对";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "注册 CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS 版本";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 属性";
"06 09 2B 06 01 04 01 82 37 11 01"			= "本地机器密钥集";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft 注册基础结构";
"06 09 2B 06 01 04 01 82 37 14 01"			= "自动注册 CTL 使用";
"06 09 2B 06 01 04 01 82 37 14 02"			= "注册证书类型";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "注册代理";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "智能卡登录";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT 主名称";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft 证书服务器基础结构";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA 续订版本";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM 版本";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM 属性";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "文稿名称";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "文稿描述";
"06 09 2B 06 01 04 01 82 37 58 03"			= "加密数据";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "加密的内容";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT 策略标识符";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL 策略标识符";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA 策略标识符";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "带 SHA-1 的 ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "带 RIPEMD-160 的 ElGamal";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib 属性";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib 存在检查";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP 响应 RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP 响应 RTCS 扩展";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL 扩展原因";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "密钥功能";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI 引导";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib 内容";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib 配置数据";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib 用户索引";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib 用户信息";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY 策略标识符";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "时间凭据";
"06 08 2B 06 01 04 01 AA 60 01"		= "时间签名系统";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "时间签名系统 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "时间签名系统 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "时间签名系统 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "第二实践";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "医务人员标识符";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos 鉴定数据";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman 密钥数据";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos 回复密钥数据";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos 客户端鉴定";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos 密钥分发中心 (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "简单公钥机制 (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "公共密钥基础结构";

"06 07 2B 06 01 05 05 07 01"		= "PKIX 专用证书扩展";
"06 08 2B 06 01 05 05 07 01 01"		= "证书代理信息访问";
"06 08 2B 06 01 05 05 07 01 02"		= "生物信息";
"06 08 2B 06 01 05 05 07 01 03"		= "合格证书声明";
"06 08 2B 06 01 05 05 07 01 04"		= "属性证书审核身份";
"06 08 2B 06 01 05 05 07 01 05"		= "属性证书目标";
"06 08 2B 06 01 05 05 07 01 06"		= "属性证书代理控制";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP 地址块";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP 自治系统标识符";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP 路由器标识符";
"06 08 2B 06 01 05 05 07 01 0A"		= "属性证书代理";
"06 08 2B 06 01 05 05 07 01 0B"		= "主题信息访问";
"06 08 2B 06 01 05 05 07 01 0C"		= "标识";

"06 07 2B 06 01 05 05 07 02"		= "策略限定符类型";
"06 08 2B 06 01 05 05 07 02 01"		= "证书实践声明";
"06 08 2B 06 01 05 05 07 02 02"		= "用户注意事项";
"06 08 2B 06 01 05 05 07 02 03"		= "文本注意事项";

"06 07 2B 06 01 05 05 07 03"		= "密钥用途";
"06 08 2B 06 01 05 05 07 03 01"		= "服务器鉴定";
"06 08 2B 06 01 05 05 07 03 02"		= "客户端鉴定";
"06 08 2B 06 01 05 05 07 03 03"		= "代码签名";
"06 08 2B 06 01 05 05 07 03 04"		= "电子邮件保护";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC 端系统";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC 隧道";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC 用户";
"06 08 2B 06 01 05 05 07 03 08"		= "时间戳";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP 签名";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA 服务器鉴定";

"06 07 2B 06 01 05 05 07 04"		= "CMP 信息类型";
"06 08 2B 06 01 05 05 07 04 01"		= "CA 协议加密证书";
"06 08 2B 06 01 05 05 07 04 02"		= "签名密钥对类型";
"06 08 2B 06 01 05 05 07 04 03"		= "加密密钥对类型";
"06 08 2B 06 01 05 05 07 04 04"		= "首选对称算法";
"06 08 2B 06 01 05 05 07 04 05"		= "CA 密钥更新信息";
"06 08 2B 06 01 05 05 07 04 06"		= "当前的 CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "不支持的 OID";
"06 08 2B 06 01 05 05 07 04 08"		= "订阅请求";
"06 08 2B 06 01 05 05 07 04 09"		= "订阅响应";
"06 08 2B 06 01 05 05 07 04 0A"		= "密钥对参数请求";
"06 08 2B 06 01 05 05 07 04 0B"		= "密钥对参数响应";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF 注册";
"06 08 2B 06 01 05 05 07 05 01"		= "注册控制";
"06 09 2B 06 01 05 05 07 05 01 01"	= "注册令牌";
"06 09 2B 06 01 05 05 07 05 01 02"	= "鉴定者";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI 发布信息";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI 归档选项";
"06 09 2B 06 01 05 05 07 05 01 05"	= "旧的证书 ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "协议加密密钥";
"06 09 2B 06 01 05 05 07 05 01 07"	= "备用证书模板";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS 模板";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF 注册信息";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 对";
"06 09 2B 06 01 05 05 07 05 02 02"	= "证书请求";

"06 07 2B 06 01 05 05 07 06"		= "算法";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "无签名";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC 控制";

"06 07 2B 06 01 05 05 07 08"		= "其他名称";
"06 08 2B 06 01 05 05 07 08 01"		= "个人数据";
"06 08 2B 06 01 05 05 07 08 02"		= "用户组";

"06 07 2B 06 01 05 05 07 09"		= "个人数据";
"06 08 2B 06 01 05 05 07 09 01"		= "出生日期";
"06 08 2B 06 01 05 05 07 09 02"		= "出生地点";
"06 08 2B 06 01 05 05 07 09 03"		= "曾用名";
"06 08 2B 06 01 05 05 07 09 04"		= "性别";
"06 08 2B 06 01 05 05 07 09 05"		= "国籍";
"06 08 2B 06 01 05 05 07 09 06"		= "居住国";

"06 07 2B 06 01 05 05 07 0A"		= "属性证书";
"06 08 2B 06 01 05 05 07 0A 01"		= "鉴定信息";
"06 08 2B 06 01 05 05 07 0A 02"		= "访问身份";
"06 08 2B 06 01 05 05 07 0A 03"		= "计费身份";
"06 08 2B 06 01 05 05 07 0A 04"		= "群组";
"06 08 2B 06 01 05 05 07 0A 05"		= "职能";
"06 08 2B 06 01 05 05 07 0A 06"		= "无线局域网 SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "在线证书状态协议";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP 基本响应";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP 临时扩展";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL 参考";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP 响应";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP 无撤消检查";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP 归档中止";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP 服务定位符";

"06 08 2B 06 01 05 05 07 30 02"		= "CA 签发者";
"06 08 2B 06 01 05 05 07 30 03"		= "时间戳";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE 中级";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC 加密算法";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC 哈希算法";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC 签名算法";
"06 07 2B 0C 02 87 73 07 03 01"		= "带 RSA 的 DEC MD2";
"06 07 2B 0C 02 87 73 07 03 02"		= "带 RSA 的 DEC MD4";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "带 RSA 的 MD4";
"06 05 2B 0E 03 02 03"				= "带 RSA 的 MD5";
"06 05 2B 0E 03 02 04"				= "带 RSA 加密的 MD4";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "带 RSA 的 SqMod-N";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA 签名";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "带 SHA 的 DSA";
"06 05 2B 0E 03 02 0E"				= "带 RSA 签名的 MDC2";
"06 05 2B 0E 03 02 0F"				= "带 RSA 签名的 SHA";
"06 05 2B 0E 03 02 10"				= "带通用模数的 Diffie-Hellman";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA 通用";
"06 05 2B 0E 03 02 15"				= "带 SHA 的 DSA 通用";
"06 05 2B 0E 03 02 16"				= "RSA 密钥传输";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "带 RSA 签名的 MD2";
"06 05 2B 0E 03 02 19"				= "带 RSA 签名的 MD5";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "带 SHA-1 的 DSA";
"06 05 2B 0E 03 02 1C"				= "带通用 SHA-1 的 DSA";
"06 05 2B 0E 03 02 1D"				= "带 RSA 加密的 SHA-1";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "带 RSA 的 MD2";
"06 06 2B 0E 07 02 03 02"			= "带 ElGamal 的 MD2";

/* Teletrust */

"06 03 2B 24 01"					= "文稿";
"06 04 2B 24 01 01"					= "最终版本";
"06 04 2B 24 01 02"					= "草稿";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "算法";
"06 04 2B 24 03 01"					= "加密算法";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA 加密";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "哈希算法";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 单长度";
"06 05 2B 24 03 02 05"				= "MDC2 双长度";
"06 04 2B 24 03 03"					= "签名算法";
"06 05 2B 24 03 03 01"				= "RSA 签名";

"06 06 2B 24 03 03 01 01"			= "带 SHA-1 的 RSA 签名";
"06 09 2B 24 03 03 01 01 84 00 02"	= "带 SHA-1 512/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 01 85 00 02"	= "带 SHA-1 640/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 01 86 00 02"	= "带 SHA-1 768/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 01 87 00 02"	= "带 SHA-1 896/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 01 88 00 02"	= "带 SHA-1 1024/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 01 84 00 03"	= "带 SHA-1 512/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 01 85 00 03"	= "带 SHA-1 640/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 01 86 00 03"	= "带 SHA-1 768/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 01 87 00 03"	= "带 SHA-1 896/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 01 88 00 03"	= "带 SHA-1 1024/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 01 84 00 05"	= "带 SHA-1 512/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 01 85 00 05"	= "带 SHA-1 640/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 01 86 00 05"	= "带 SHA-1 768/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 01 87 00 05"	= "带 SHA-1 896/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 01 88 00 05"	= "带 SHA-1 1024/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 01 84 00 09"	= "带 SHA-1 512/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 01 85 00 09"	= "带 SHA-1 640/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 01 86 00 09"	= "带 SHA-1 768/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 01 87 00 09"	= "带 SHA-1 896/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 01 88 00 09"	= "带 SHA-1 1024/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 01 84 00 11"	= "带 SHA-1 512/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 01 85 00 11"	= "带 SHA-1 640/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 01 86 00 11"	= "带 SHA-1 768/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 01 87 00 11"	= "带 SHA-1 896/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 01 88 00 11"	= "带 SHA-1 1024/L11 的 RSA 签名";

"06 06 2B 24 03 03 01 02"			= "带 RIPEMD-160 的 RSA 签名";
"06 09 2B 24 03 03 01 02 84 00 02"	= "带 RIPEMD-160 512/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 02 85 00 02"	= "带 RIPEMD-160 640/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 02 86 00 02"	= "带 RIPEMD-160 768/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 02 87 00 02"	= "带 RIPEMD-160 896/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 02 88 00 02"	= "带 RIPEMD-160 1024/L2 的 RSA 签名";
"06 09 2B 24 03 03 01 02 84 00 03"	= "带 RIPEMD-160 512/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 02 85 00 03"	= "带 RIPEMD-160 640/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 02 86 00 03"	= "带 RIPEMD-160 768/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 02 87 00 03"	= "带 RIPEMD-160 896/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 02 88 00 03"	= "带 RIPEMD-160 1024/L3 的 RSA 签名";
"06 09 2B 24 03 03 01 02 84 00 05"	= "带 RIPEMD-160 512/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 02 85 00 05"	= "带 RIPEMD-160 640/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 02 86 00 05"	= "带 RIPEMD-160 768/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 02 87 00 05"	= "带 RIPEMD-160 896/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 02 88 00 05"	= "带 RIPEMD-160 1024/L5 的 RSA 签名";
"06 09 2B 24 03 03 01 02 84 00 09"	= "带 RIPEMD-160 512/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 02 85 00 09"	= "带 RIPEMD-160 640/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 02 86 00 09"	= "带 RIPEMD-160 768/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 02 87 00 09"	= "带 RIPEMD-160 896/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 02 88 00 09"	= "带 RIPEMD-160 1024/L9 的 RSA 签名";
"06 09 2B 24 03 03 01 02 84 00 11"	= "带 RIPEMD-160 512/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 02 85 00 11"	= "带 RIPEMD-160 640/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 02 86 00 11"	= "带 RIPEMD-160 768/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 02 87 00 11"	= "带 RIPEMD-160 896/L11 的 RSA 签名";
"06 09 2B 24 03 03 01 02 88 00 11"	= "带 RIPEMD-160 1024/L11 的 RSA 签名";

"06 06 2B 24 03 03 01 03"			= "带 RIPEMD-128 的 RSA 签名";
"06 06 2B 24 03 03 01 04"			= "带 RIPEMD-256 的 RSA 签名";

"06 05 2B 24 03 03 02"				= "ECSIE 签名";
"06 06 2B 24 03 03 02 01"			= "带 SHA-1 的 ECSIE 签名";
"06 06 2B 24 03 03 02 02"			= "带 RIPEMD-160 的 ECSIE 签名";
"06 06 2B 24 03 03 02 03"			= "带 MD2 的 ECSIE 签名";
"06 06 2B 24 03 03 02 04"			= "带 MD5 的 ECSIE 签名";

"06 04 2B 24 03 04"					= "签名方案";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "带 RED 的 ISO9796-2";
"06 06 2B 24 03 04 02 02"			= "带 RSA 的 ISO9796-2";
"06 06 2B 24 03 04 02 03"			= "带 RND 的 ISO9796-2";

"06 03 2B 24 04"					= "属性";
"06 03 2B 24 05"					= "策略";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "制造商专用 API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "功能性专用 API";
"06 03 2B 24 07"					= "密钥管理";
"06 04 2B 24 07 01"					= "密钥协议";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "密钥转移";
"06 05 2B 24 07 02 01"				= "带 RSA 加密的 ISO9796-2";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform 策略标识符";
"06 05 2B 24 08 02 01"				= "目录服务";

"06 05 2B 24 08 03 01"				= "证书生成日期";
"06 05 2B 24 08 03 02"				= "代理权";
"06 05 2B 24 08 03 03"				= "许可";
"06 05 2B 24 08 03 04"				= "财政限制";
"06 05 2B 24 08 03 05"				= "大多数的申明";
"06 05 2B 24 08 03 06"				= "集成电路卡序列号码";
"06 05 2B 24 08 03 07"				= "公共密钥参考";
"06 05 2B 24 08 03 08"				= "限制";
"06 05 2B 24 08 03 09"				= "允许即取回";
"06 05 2B 24 08 03 0A"				= "请求的证书";
"06 05 2B 24 08 03 0B"				= "命名授权";
"06 05 2B 24 08 03 0C"				= "目录中的证书，开始于";
"06 05 2B 24 08 03 0D"				= "哈希证书";

"06 05 2B 24 08 04 01"				= "个人数据";
"06 05 2B 24 08 04 08"				= "限制";
"06 07 2B 24 08 05 01 01 01"		= "RSA 表示 SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA 表示 RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "带 SHA-1 的 RSA";
"06 07 2B 24 08 05 01 01 04"		= "带 RIPEMD-160 的 RSA";
"06 07 2B 24 08 05 01 02 01"		= "DSA 扩展";
"06 07 2B 24 08 05 01 02 02"		= "带 RIPEMD-160 的 DSA";

"06 05 2B 24 08 06 01"				= "证书";
"06 05 2B 24 08 06 02"				= "证书参考";
"06 05 2B 24 08 06 03"				= "属性证书";
"06 05 2B 24 08 06 04"				= "属性参考";
"06 05 2B 24 08 06 05"				= "文件名";
"06 05 2B 24 08 06 06"				= "存储时间";
"06 05 2B 24 08 06 07"				= "文件大小";
"06 05 2B 24 08 06 08"				= "位置";
"06 05 2B 24 08 06 09"				= "签名号码";
"06 05 2B 24 08 06 0A"				= "自动生成的";

"06 05 2B 24 08 07 01"				= "Teletrust 表示类型";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "二进制";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "文本";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte 证书扩展";
"06 05 2B 65 01 04 01"				= "强外部网";

/* X.520 */

"06 02 55 04"		= "X.520 属性类型";
"06 03 55 04 00"	= "对象类";
"06 03 55 04 01"	= "条目的替身";
"06 03 55 04 02"	= "知识信息";
"06 03 55 04 03"	= "通用名称";
"06 03 55 04 04"	= "姓氏";
"06 03 55 04 05"	= "序列号";
"06 03 55 04 06"	= "国家或地区名称";
"06 03 55 04 07"	= "所在地名称";
"06 04 55 04 07 01"	= "集合所在地名称";
"06 03 55 04 08"	= "州或省名称";
"06 04 55 04 08 01"	= "集合州或省名称";
"06 03 55 04 09"	= "街道地址";
"06 04 55 04 09 01"	= "集合街道地址";
"06 03 55 04 0A"	= "组织名称";
"06 04 55 04 0A 01"	= "集合组织名称";
"06 03 55 04 0B"	= "组织单位名称";
"06 04 55 04 0B 01"	= "集合组织单位名称";
"06 03 55 04 0C"	= "标题";
"06 03 55 04 0D"	= "描述";
"06 03 55 04 0E"	= "搜索指南";
"06 03 55 04 0F"	= "商务类别";
"06 03 55 04 10"	= "邮政地址";
"06 04 55 04 10 01"	= "集合邮政地址";
"06 03 55 04 11"	= "邮政编码";
"06 04 55 04 11 01"	= "集合邮政编码";
"06 03 55 04 12"	= "邮政信箱";
"06 04 55 04 12 01"	= "集合邮政信箱";
"06 03 55 04 13"	= "实物交货地点名称";
"06 04 55 04 13 01"	= "集合实物交货地点名称";
"06 03 55 04 14"	= "电话号码";
"06 04 55 04 14 01"	= "集合电话号码";
"06 03 55 04 15"	= "电报挂号";
"06 04 55 04 15 01"	= "集合电报号码";
"06 03 55 04 16"	= "电报终端标识符";
"06 04 55 04 16 01"	= "集合电报终端设备标识符";
"06 03 55 04 17"	= "传真号码";
"06 04 55 04 17 01"	= "集合传真号码";
"06 03 55 04 18"	= "X.121 地址";
"06 03 55 04 19"	= "国际 ISDN 号码";
"06 04 55 04 19 01"	= "集合国际 ISDN 号码";
"06 03 55 04 1A"	= "注册地址";
"06 03 55 04 1B"	= "目的指示器";
"06 03 55 04 1C"	= "首选交货方法";
"06 03 55 04 1D"	= "表示层地址";
"06 03 55 04 1E"	= "支持的应用程序上下文";
"06 03 55 04 1F"	= "成员";
"06 03 55 04 20"	= "所有者";
"06 03 55 04 21"	= "职能占有者";
"06 03 55 04 22"	= "也请参阅";
"06 03 55 04 23"	= "用户密码";
"06 03 55 04 24"	= "用户证书";
"06 03 55 04 25"	= "CA 证书";
"06 03 55 04 26"	= "授权撤消清单";
"06 03 55 04 27"	= "证书撤消清单";
"06 03 55 04 28"	= "交叉证书对";
"06 03 55 04 29"	= "名称";
"06 03 55 04 2A"	= "名字";
"06 03 55 04 2B"	= "姓名首字母";
"06 03 55 04 2C"	= "世代限定符";
"06 03 55 04 2D"	= "唯一标识符";
"06 03 55 04 2E"	= "DN 限定符";
"06 03 55 04 2F"	= "增强的搜索指南";
"06 03 55 04 30"	= "协议信息";
"06 03 55 04 31"	= "可识别名称";
"06 03 55 04 32"	= "唯一成员";
"06 03 55 04 33"	= "住宅标识符";
"06 03 55 04 34"	= "支持的算法";
"06 03 55 04 35"	= "增量撤消清单";
"06 03 55 04 36"	= "清除";
"06 03 55 04 3A"	= "交叉证书对";

/* X.500 object classes */

"06 02 55 06"		= "X.520 对象类";
"06 03 55 06 00"	= "顶部";
"06 03 55 06 01"	= "替身";
"06 03 55 06 02"	= "国家/地区";
"06 03 55 06 03"	= "所在地";
"06 03 55 06 04"	= "组织";
"06 03 55 06 05"	= "组织单位";
"06 03 55 06 06"	= "个人";
"06 03 55 06 07"	= "组织人员";
"06 03 55 06 08"	= "组织职能";
"06 03 55 06 09"	= "名称组";
"06 03 55 06 0A"	= "居住人";
"06 03 55 06 0B"	= "应用程序进程";
"06 03 55 06 0C"	= "应用程序实体";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "设备";
"06 03 55 06 0F"	= "强鉴定用户";
"06 03 55 06 10"	= "证书代理";
"06 03 55 06 11"	= "名称唯一的组";
"06 03 55 06 15"	= "PKI 用户";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500 算法";
"06 03 55 08 01"	= "X.500 加密算法";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 证书扩展";
"06 03 55 1D 01"	= "授权密钥标识符（旧）";
"06 03 55 1D 02"	= "主密钥属性（旧）";
"06 03 55 1D 03"	= "证书策略（旧）";
"06 03 55 1D 04"	= "密钥使用限制（旧）";
"06 03 55 1D 05"	= "策略映射（旧）";
"06 03 55 1D 06"	= "子树约束";
"06 03 55 1D 07"	= "主题备用名称（旧）";
"06 03 55 1D 08"	= "签发者备用名称（旧）";
"06 03 55 1D 09"	= "主题目录属性";
"06 03 55 1D 0A"	= "基本约束（旧 2.5.29.10）";
"06 03 55 1D 0B"	= "名称约束（旧）";
"06 03 55 1D 0C"	= "策略约束（旧）";
"06 03 55 1D 0D"	= "基本约束（旧 2.5.29.13）";
"06 03 55 1D 0E"	= "主题密钥标识符";
"06 03 55 1D 0F"	= "密钥使用";
"06 03 55 1D 10"	= "专用密钥使用期";
"06 03 55 1D 11"	= "主题备用名称";
"06 03 55 1D 12"	= "签发者备用名称";
"06 03 55 1D 13"	= "基本约束";
"06 03 55 1D 14"	= "证书撤消清单号码";
"06 03 55 1D 15"	= "CRL 原因代码";
"06 03 55 1D 16"	= "过期日期（旧）";
"06 03 55 1D 17"	= "保持指令代码";
"06 03 55 1D 18"	= "无效日期";
"06 03 55 1D 19"	= "CRL 分发点（旧）";
"06 03 55 1D 1A"	= "签发分发点（旧）";
"06 03 55 1D 1B"	= "增量 CRL 指示器";
"06 03 55 1D 1C"	= "签发分发点";
"06 03 55 1D 1D"	= "证书签发者";
"06 03 55 1D 1E"	= "名称约束";
"06 03 55 1D 1F"	= "CRL 分发点";
"06 03 55 1D 20"	= "证书策略";
"06 04 55 1D 20 00"	= "任何策略标识符";
"06 03 55 1D 21"	= "策略映射";
"06 03 55 1D 22"	= "策略约束";
"06 03 55 1D 23"	= "授权密钥标识符";
"06 03 55 1D 24"	= "策略约束";
"06 03 55 1D 25"	= "扩展密钥使用";
"06 04 55 1D 25 00"	= "任何扩展密钥使用";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS 签名算法";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza 签名算法";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS 机密算法";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza 机密算法";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS 完整性算法";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza 完整性算法";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS 令牌保护算法";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza 令牌保护算法";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS 密钥管理算法";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza 密钥管理算法";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS 密钥管理和签名算法";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza 密钥管理和签名算法";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A 签名算法";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A 机密算法";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A 完整性算法";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A 令牌保护算法";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A 密钥管理算法";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A 密钥管理和签名算法";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza 更新的签名算法";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza 密钥管理和更新的签名算法";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza 更新的完整性算法";
"06 09 60 86 48 01 65 02 01 01 16"	= "密钥交换算法";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 算法";
"06 09 60 86 48 01 65 02 01 01 18"	= "密钥加密算法 (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 邮件格式";
"06 09 60 86 48 01 65 02 01 02 02"	= "空内容";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP 内容类型";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 内容类型";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP 内容类型";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey 代理协议";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 内容类型";
"06 09 60 86 48 01 65 02 01 02 48"	= "转发的 MSP 邮件正文部分";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP 转发的邮件参数";
"06 09 60 86 48 01 65 02 01 02 50"	= "转发的 CSP 邮件正文部分";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP 转发的邮件参数";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS 安全策略";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "安全策略";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "通用";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "默认的安全策略";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS 密钥管理证书";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS 用户签名证书";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS 密钥管理和签名证书";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza 密钥管理证书";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza 密钥管理和签名证书";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza 用户签名证书";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA 签名证书";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA 签名证书";
"06 09 60 86 48 01 65 02 01 05 0A"	= "辅向量";
"06 09 60 86 48 01 65 02 01 05 0B"	= "回执策略";
"06 09 60 86 48 01 65 02 01 05 0C"	= "成员身份";
"06 09 60 86 48 01 65 02 01 05 0D"	= "管理员";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS 签名 CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS 签名 CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS 证书撤消清单";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza 证书撤消清单";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "被免除的地址处理器";
"06 09 60 86 48 01 65 02 01 05 30"	= "保护";
"06 09 60 86 48 01 65 02 01 05 31"	= "支持的算法";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A 密钥管理证书";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A 密钥管理和签名证书";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A 用户签名证书";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC 信息";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA 约束";
"06 09 60 86 48 01 65 02 01 05 37"	= "签名或密钥管理权限";
"06 09 60 86 48 01 65 02 01 05 38"	= "通用权限";
"06 09 60 86 48 01 65 02 01 05 39"	= "标识的属性";
"06 09 60 86 48 01 65 02 01 05 3A"	= "策略信息文件";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Sec 策略信息文件";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA 清除限制";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP 扩展";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI 安全类别";
"06 09 60 86 48 01 65 02 01 08 02"		= "标准安全标签权限";

"06 09 60 86 48 01 65 02 01 0A 01"			= "签名权限";
"06 09 60 86 48 01 65 02 01 0A 02"			= "密钥管理权限";
"06 09 60 86 48 01 65 02 01 0A 03"			= "指定标记集权限";
"06 09 60 86 48 01 65 02 01 0B 01"			= "英国演示";
"06 09 60 86 48 01 65 02 01 0B 02"			= "美国国防部 2 类";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "美国国防部 4 类";
"06 09 60 86 48 01 65 02 01 0B 05"			= "美国国防部 3 类";
"06 09 60 86 48 01 65 02 01 0B 06"			= "美国国防部 5 类";
"06 09 60 86 48 01 65 02 01 0B 09"			= "美国国防部 PKI 3 类";

"06 09 60 86 48 01 65 02 01 0C 00"			= "测试安全策略";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 安全类别";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 标记集零";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 标记集一";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 标记集二";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 安全类别";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 标记集零";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 标记集一";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 标记集二";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka 安全类别";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka 标记集名称 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka 标记集名称 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka 标记集名称 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "测试 CRL 条目";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "标签";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK 策略标识符";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA 初步策略标识符";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA 基本策略标识符";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA 中级策略标识符";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA 高级策略标识符";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA 密钥";
"06 08 60 86 48 01 65 03 02 03"			= "扩展";
"06 09 60 86 48 01 65 03 02 03 01"		= "密钥恢复技术";
"06 09 60 86 48 01 65 03 02 03 02"		= "密钥恢复功能";
"06 09 60 86 48 01 65 03 02 03 03"		= "密钥恢复";
"06 08 60 86 48 01 65 03 02 04"			= "密钥恢复方案";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK 扩展";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST 算法";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell 算法";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "带 RSA 加密 BSAFE1 的 MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "带 RSA 加密 BSAFE1 的 MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "带 RSA 加密 BSAFE1 的 SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM 摘要";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "带 SHA1-RSA 的 IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "带 MD5-RSA 的 IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 包";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA 加密 BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW 密码";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI 属性类型";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "安全属性";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "信任限制";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape 对象标识符";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape 证书扩展";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape 证书类型";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape 基本 URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape 撤消 URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA 撤消 URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL 下载 URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA 证书下载 URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape 证书续订 URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA 策略 URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape 证书主页 URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape 证书实体标志";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape 证书用户图片";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL 服务器名称";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape 证书注释";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape 数据类型";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape 证书序列";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape 证书 URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape 目录对象标识符";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP 定义";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "车牌";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "部门编号";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "雇员编号";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "雇员类型";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "内部网组织人员";

"06 09 60 86 48 01 86 F8 42 04 01"		= "服务器选通秘密成员";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign 收件箱";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "未知 Verisign VPN 扩展";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "未知 Verisign VPN 扩展";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign 策略标识符";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 通知";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "内容类型";
"06 04 67 2A 00 00"	= "PAN 数据";
"06 04 67 2A 00 01"	= "PAN 令牌";
"06 04 67 2A 00 02"	= "仅 PAN";

"06 03 67 2A 01"	= "邮件扩展";
"06 03 67 2A 02"	= "字段";
"06 04 67 2A 02 00"	= "全名";
"06 04 67 2A 02 01"	= "名字";
"06 04 67 2A 02 02"	= "姓氏";
"06 04 67 2A 02 03"	= "婚前的姓氏";
"06 04 67 2A 02 04"	= "地名";
"06 04 67 2A 02 05"	= "身份证号码";
"06 04 67 2A 02 06"	= "月";
"06 04 67 2A 02 07"	= "日期";
"06 04 67 2A 02 08"	= "地址";
"06 04 67 2A 02 09"	= "电话";
"06 04 67 2A 02 0A"	= "数量";
"06 04 67 2A 02 0B"	= "帐号";
"06 04 67 2A 02 0C"	= "口令";

"06 03 67 2A 03"		= "属性";
"06 04 67 2A 03 00"		= "证书";
"06 05 67 2A 03 00 00"	= "根密钥指纹";
"06 05 67 2A 03 00 01"	= "附加策略";

"06 03 67 2A 04"	= "算法";
"06 03 67 2A 05"	= "策略";
"06 04 67 2A 05 00"	= "根";
"06 03 67 2A 06"	= "模块";
"06 03 67 2A 07"	= "证书扩展";
"06 04 67 2A 07 00"	= "哈希根密钥";
"06 04 67 2A 07 01"	= "证书类型";
"06 04 67 2A 07 02"	= "商业数据";
"06 04 67 2A 07 03"	= "要求卡证书";
"06 04 67 2A 07 04"	= "隧道";
"06 04 67 2A 07 05"	= "SET 扩展";
"06 04 67 2A 07 06"	= "SET 限定符";

"06 03 67 2A 08"	= "商标";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "供应商";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "国家";
"06 05 67 2A 0A E2 00"	= "日本";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "哈希根密钥";
"06 04 86 8D 6F 03"	= "证书类型";
"06 04 86 8D 6F 04"	= "商业数据";
"06 04 86 8D 6F 05"	= "要求卡证书";
"06 04 86 8D 6F 06"	= "隧道";
"06 04 86 8D 6F 07"	= "SET 限定符";
"06 04 86 8D 6F 63"	= "SET 数据";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple 数据安全";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple 信任策略标识符";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign 策略";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 基本策略";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL 策略";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple 本地证书生成策略";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple 本地 CSR 生成策略";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL 撤消策略";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP 撤消策略";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME 策略";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple 可扩展鉴定策略";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple Software Update 签名策略";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec 策略";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat 策略";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple 资源签名策略";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos 客户端策略";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos 服务器策略";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple 代码签名策略";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple 软件包签名策略";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple 安全算法标识符";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "快速简要加密 (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple 安全压缩 (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "带 MD5 签名的 FEE";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "带 SHA-1 签名的 FEE";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED 加密";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED（实验）";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "带 ECDSA 签名的 FEE";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac 证书标识";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac 证书请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac 身份证书请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac 电子邮件签名证书请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac 电子邮件加密证书请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac 归档列表请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac 归档存储请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac 归档取回请求";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac 归档移除请求";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac 证书扩展";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac 身份";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac 电子邮件签名";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac 电子邮件加密";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac 证书请求值";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "用户名";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "密码";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "主机名";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "续订标志";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "异步标志";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple 扩展密钥使用";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple 代码签名";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple 代码签名（开发）";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple Software Update 签名";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple 代码签名（已保留）";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple 资源签名";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat 签名";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat 加密";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple 系统身份";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple 证书政策";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple 证书政策";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac 证书政策";

/* Extended key usage */

"06 04 55 1D 25 03"					= "代码签名";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA 安全";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA 安全格式";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 证书扩展";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 专用证书扩展";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "主题签名位图";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "主题图片";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "主题电子邮件地址";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "使用免除";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA 安全算法";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "带 ECDSA 的 SHA-1";

/* end */
